{
  "home": "Strona główna",
  "career": "Kariera",
  "projects": "Projekty",
  "free_time": "W wolnym czasie",
  "contact": "Kontakt",
  "copyrights": "Wszelkie prawa zastrzeżone © - Krzysztof Bartosik 2023",
  "hello": "Cześć!",
  "hello_msg": "Mam na imię Krzysztof i chciałbym Ci zaprezentować moją prywatną stronę! Jestem web developerem z ponad 10 letnim doświadczeniem. Znajdziesz tutaj kilka słów o mnie, mojej karierze, dodatkowych projektach, a także parę innych rzeczy ;) ",
  "developer": "Programista",
  "developer_desc": "Zaczynałem jako web developer w JS przy tworzeniu interfejsu webowego opartego na technologi GWT w aplikacji klasy Telco OSS. Kolejnym etapem był rozwój serwisów w Javie oraz warstwy frontendowej w JS produktu do wizualizacji szaf w serwerowniach. Następnie trafiłem do zespołu budującego interfejs do systemu OSS w React.",
  "team_leader": "Szef zespołu",
  "team_leader_desc": "Jako szef zespołu budującego framework webowy wspomniany niżej, moim zadaniem było kierowanie około 8 osobowym zespołem oraz aktywny development. Uczestniczyłem w technicznych częściach rekrutacji pracowników, prowadziłem analizy techniczne, projektowałem architekturę webowego klienta do systemu Comarch OSS Console. Wyzwaniem było tworzenie komponentów wspólnych, spełniających różnorodne wymagania biznesowe.",
  "team_leader_desc_new": "Po restrukturyzacji w Comarch, wróciłem do prowadzenia zespołu z bagażem doświadczeń jako dyrektor działu i świeżym spojrzeniem. Zadaniem jest prowadzenie zespołu, który w wydajny sposób produkuje interfejs do core'owych funkcji systemu Comarch OSS Console z najwyższą jakością.",
  "director": "Dyrektor działu Web R&D",
  "director_desc": "W dziale którego byłem dyrektorem pracowało około 30 osób, podzielonych na 4 zespoły. Zespoły zajmowały się zarówno front-endem jak i back-endem dotyczącym najbardziej core'owyc funkcji systemu Comarch OSS Console. W międzyczasie ukończyłem szkolenia Comarch Akademia Zarządzania oraz Akademia Lidera. Moje obowiązki obejmowały nadzór nad realizacją roadmpay zespołów, prowadzenie rekrutacji, rozwój oraz mentoring pracowników, a także prowadzenie spraw kadrowych. Oprócz tego definiowanie i realizacja strategii w dziale oraz analiza ryzyk w trakcie produkcji.",
  "snow_plow_project_label": "Projekt realizowany na zlecenie firmy zarządzającej drogami krajowymi na śląsku. Zbudowany w oparciu o mikrokomputer Raspberry PI oraz podłączony do niego pirometr. Software napisany głównie w języku Java oraz częściowo w Pythonie. Urządzenie ma za zadanie w czasie rzeczywistym wyświetlać kierowcy temperaturę nawierzchni oraz sugerowana dawkę soli drogowej, która powinna być wysypana na jezdnię w warunkach zimowych. Największym wyzwaniem było zaprojektowanie układu, konfiguracja hardware'u oraz integracja między pirometrem a softem. Aplikacja wyświetla dane z czujnika oraz dawkę soli w oparciu o okna Swing.",
  "room_planner_project_label": "Projekt napisany w ramach pracy magisterskiej. Aplikacja miała pomóc w wizualizacji rozstawienia mebli w mieszkaniu, podobnie jak planner Ikea. Widok z góry pomieszczenia, oczywiście zachowane proporcje pomieszczenia oraz wstawionych do niego mebli. Backend był napisany w Javie, serwisy łączyły się z relacyjną bazą danych MySQL. Frontend to praktycznie czysty JavaScript, wspomagany bibliotekami, m. in. JQuery. Dostępne było logowanie, użytkownik mógł na swoim koncie zapisywać plany pomieszczeń wraz z umeblowaniem. Katalog produktów pozwalał na dodawanie mebli z wizualizacją zarówno w SVG jak i obrazkach rastrowych. Wykrywana była także podstawowa kolizja obiektów.",
  "android_todo_project_label": "Projekt napisany w ramach pracy inzynierskiej. Aplikacja pisana w Javie, jeszcze pod Androida 2.3. Głównym założeniem aplikacji była możliwość dodawania głosowego nowych elementów list, co było dosyć nowatorskim pomysłem jak na rok 2013. Aplikacja miała także opcję wyszukiwania sklepów w okolicy na mapach Google, a także dzielenia się listą za pomocą e-mail. ",
  "comarch_oss_project_label": "Comarch OSS to komercyjne rozwiązanie dla największych telekomów na świecie. Z oczywistych względów, nie mogę dokładnie opisać co się w nim znajduje, natomiast opiszę jak wyglądała praca przy tym projekcie. Spędziłem wiele lat przy budowie frontendu w ramach tego systemu. Oprócz komercyjnej pracy w JS, React, Javie i wielu podobczynch technologiach, z którymi miałem styczność, poznałem także wiele aspektów związnych z telekomunikacją. Oprócz tego zdobyłem doświadczenie jakie wyzwania czają się przy prowadzeniu projektów, pracy z klientami. Nauczyłem się pracy w kilkuset osobowym środowisku, gdzie rozproszone zespoły budują jeden wielki system. Link do oficjalnej strony Comarch poniżej. ",
  "comarch_oss_project_title": "Comarch OSS Console",
  "snow_plow_project_title": "Asystent odśnieżania",
  "room_planner_project_title": "Room Planner",
  "android_todo_project_title":  "Voice Todo",
  "gaming_title": "Gaming",
  "gaming_desc": "Gry wideo to moja pasja od małego. Jedni z tego wyrastaja, a ja chyba nie :) Nie jestem specjalnie wybredny, lubię każdy gatunek gier - zręcznościowe, strzelanki, strategie, logiczne, ale chyba najbardziej wszelkiego rodzaju RPG. Jeśli chcesz w coś popykać to istnieje spora szansa, że się uda ;) Poniżej zamieszczam niżej linki do platform. Możesz pisać, śmiało!",
  "sport_title": "Sport",
  "sport_desc": "Uwielbiam sport! Oglądać, uprawiać (o ile mam czas), zwłaszcza piłkę nożną. Jako nastolatek grałem w klubie w rodzinnym mieście, jednak los chciał, abym swoją karierę kontynuował przed komupterem, zamiast na boisku :) Oprócz piłki noznej, która zdecydowanie jest moim numerem jeden, chętnie obejrzę wszelkie zmagania, zwłaszcza, jeśli występują zawodnicy z biało-czerwonym orłem na piersi. Jedynie golfa nie bardzo rozumiem, chociaż chciałbym kiedyś spróbować zagrać :)",
  "horus_title": "Horus (bengal)",
  "horus_desc": "Mój kot - łobuz. Urodzony w lipcu 2022, pełen energii rozrabiaka. Horusio jest kotem bengalskim, poniżej wrzucam link do wikipedii. Wszędzie go pełno, uwielbia przeszkadzać w mopowaniu podłogi. Jednak jak już skończy rozrabiać, jest to najukochańszy i najfajniejszy kot na świecie. Zna kilka sztuczek, a za \"smaczki\" zrobi wszystko. Niektórzy twierdzą, że to pies, tylko trochę inaczej wygląda.",
  "modelling_title": "Modelarstwo",
  "modelling_desc": "Początkiem 2023 roku wróciłem do tego hobby sprzed lat. Jako dziecko sklejałem modele, jednak dopiero po reaktywacji tego zajęcia zobaczyłem jakie dzieła sztuki są w stanie zrobić najlepsi modelarze. Mnie do nich jeszcze wiele brakuje, ale mój pierwszy model F-14 Tomcat który jest obok, uważam, że wyszedł nienajgorzej. Kolejne projekty już są na horyzoncie!",
  "dyi_title": "Majsterkowanie",
  "dyi_desc": "Elektronarzędzia, zapach szlifowanego i wierconego drewna, to jest to! Raz za jakiś czas zdarzy mi się troszkę pomajsterkować. Zmysł inżyniera na pewno pomaga w realizacji różnych projektów, na zdjęciu skrzynio-leżanka na balkon. Bardzo lubię budować, jako dziecko z klocków Lego, jako programista z klocków w React'cie, a w razie potrzeby z drewna lub karton-gipsu :) Zawsze nagroda jest taka sama - efekty pracy i satysfakcja, że własnymi rękoma można zrobić coś z niczego.",
  "contact_info": "Znalazłeś(aś) coś interesującego na mojej stronie? Chcesz się skontaktować? Śmiało, skorzystaj z formularza poniżej!",
  "email_label": "Twój e-mail",
  "name_label": "Twoje imię",
  "message_label": "Wiadomość",
  "submit_btn_label": "Wyślij",
  "message_sent": "Wysłano wiadomość!",
  "message_not_sent": "Ups, coś poszło nie tak",
  "contact_confirmation": "Dziękuję za wysłanie wiadomości! Odpowiem najszybciej jak będę mógł!",
  "contact_error_msg": "Niestety wysłanie wiadomości nie powiodło się, spróbuj ponownie później :(",
  "close": "Zamknij"
}