{
  "home": "Home",
  "career": "Career",
  "projects": "Projects",
  "free_time": "Free Time",
  "contact": "Contact",
  "copyrights": "Krzysztof Bartosik © 2023",
  "hello": "Hello!",
  "hello_msg": "My name is Krzysztof, and I would like to present my personal website to you! I am a web developer with over 10 years of experience. Here you will find a few words about me, my career, additional projects, and a few other things ;)",
  "developer": "Developer",
  "developer_desc": "I started as a web developer in JS creating a web interface based on GWT technology in a Telco OSS-class application. The next stage was the development of Java services and the frontend layer in JS for a product visualizing server room cabinets. Later, I joined a team building the interface for the OSS system in React.",
  "team_leader": "Team Leader",
  "team_leader_desc": "As the leader of the team building the mentioned web framework, my task was to lead an approximately 8-person team and actively participate in development. I was involved in the technical parts of employee recruitment, conducted technical analyses, designed the web client architecture for the Comarch OSS Console system. The challenge was to create common components that meet diverse business requirements.",
  "team_leader_desc_new": "After the restructuring at Comarch, I returned to leading a team with a wealth of experiences as a department director and a fresh perspective. The task is to lead a team that efficiently produces the interface for the core functions of the Comarch OSS Console system with the highest quality.",
  "director": "Director of Web R&D Department",
  "director_desc": "In the department I directed, there were about 30 people divided into 4 teams. The teams dealt with both frontend and backend related to the core functions of the Comarch OSS Console system. In the meantime, I completed training at Comarch Management Academy and Leadership Academy. My duties included overseeing the implementation of the teams' roadmaps, conducting recruitment, employee development and mentoring, as well as handling personnel matters. In addition, defining and implementing the department's strategy and risk analysis during production.",
  "snow_plow_project_label": "A project commissioned by a company managing national roads in Silesia. Built based on a Raspberry PI microcomputer and connected to it a pyrometer. Software mainly written in Java and partly in Python. The device's task is to display the surface temperature and suggested dose of road salt to be spread on the road in winter conditions in real-time. The biggest challenge was designing the system, configuring the hardware, and integrating between the pyrometer and the software. The application displays data from the sensor and the dose of salt based on Swing windows.",
  "room_planner_project_label": "A project written as part of my master's thesis. The application was supposed to help visualize the arrangement of furniture in an apartment, similar to Ikea's planner. Top view of the room, of course, maintaining the proportions of the room and the furniture placed in it. The backend was written in Java, the services connected to a MySQL relational database. The frontend is practically pure JavaScript, supported by libraries, including JQuery. There was login functionality, allowing users to save room plans with furnishings on their accounts. The product catalog allowed adding furniture with visualization in both SVG and raster images. Basic collision detection was also implemented.",
  "android_todo_project_label": "A project written as part of my engineering thesis. The application was written in Java, still under Android 2.3. The main idea of the application was the ability to voice-add new items to lists, which was quite innovative for 2013. The application also had the option of searching for nearby stores on Google Maps and sharing the list via email.",
  "comarch_oss_project_label": "Comarch OSS is a commercial solution for the world's largest telecoms. For obvious reasons, I cannot describe exactly what is in it, but I will describe what working on this project looked like. I spent many years building the frontend within this system. In addition to commercial work in JS, React, Java, and many similar technologies I encountered, I also learned many aspects related to telecommunications. In addition, I gained experience in the challenges that lie in leading projects and working with clients. I learned to work in a several hundred-person environment, where dispersed teams build one large system. Link to the official Comarch website below.",
  "comarch_oss_project_title": "Comarch OSS Console",
  "snow_plow_project_title": "Snow Plow Assistant",
  "room_planner_project_title": "Room Planner",
  "android_todo_project_title": "Voice Todo",
  "gaming_title": "Gaming",
  "gaming_desc": "Video games have been my passion since childhood. Some outgrow it, but I probably haven't :) I'm not particularly picky; I enjoy every genre of games - action, shooters, strategies, puzzles, but I think I'm most into all kinds of RPGs. If you want to play something, there's a good chance it will work out ;) Below, I've included links to platforms. Feel free to message!",
  "sport_title": "Sport",
  "sport_desc": "I love sports! Watching, playing (if I have time), especially soccer. As a teenager, I played for a club in my hometown, but fate decided that I would continue my career in front of a computer rather than on the field. Besides soccer, which is definitely my number one, I'm eager to watch any kind of competition, especially if there are players with the white eagle on their chest. The only sport I don't quite understand is golf, although I would like to try playing it someday.",
  "horus_title": "Horus (Bengal Cat)",
  "horus_desc": "Our cat - a rascal. Born in July 2022, full of energy and mischief. Horusio is a Bengal cat, and I'm including a link to Wikipedia below. He's everywhere, loves to interfere while mopping the floor. However, once he's done causing trouble, he's the most beloved and coolest cat in the world. He knows a few tricks, and he'll do anything for treats. Some say he's more like a dog, just looks a bit different.",
  "modelling_title": "Modeling",
  "modelling_desc": "At the beginning of 2023, I returned to this hobby from years ago. As a child, I used to assemble models, but it was only after rekindling this activity that I saw the incredible works of art that the best modelers can create. I still have a lot to learn from them, but I consider my first model, the F-14 Tomcat next to me, to have turned out not too bad. More projects are already on the horizon!",
  "dyi_title": "DIY",
  "dyi_desc": "Power tools, the scent of sanded and drilled wood, that's the stuff! Every now and then, I find myself tinkering a bit. The engineer's sense certainly helps in the execution of various projects, as seen in the photo of the balcony crate-bed. I really enjoy building, whether it's from Lego blocks as a child, from React code as a programmer, or from wood or cardboard-gypsum when needed. The reward is always the same - the results of the work and the satisfaction that comes from creating something from scratch with your own hands.",
  "contact_info": "Found something interesting on my website? Want to get in touch? Feel free to use the form below!",
  "email_label": "Your email",
  "name_label": "Your name",
  "message_label": "Message",
  "submit_btn_label": "Send",
  "message_sent": "Message sent!",
  "message_not_sent": "Oops, something went wrong",
  "contact_confirmation": "Thank you for sending the message! I will reply as soon as I can!",
  "contact_error_msg": "Unfortunately, sending the message did not succeed. Please try again later :(",
  "close": "Close",
  "welcome_hello_msg": "Welcome",
  "welcome_name_msg": "My name is Krzysztof Bartosik.",
  "welcome_profession1_msg": "I am a Web Developer.",
  "welcome_profession2_msg": "I am an engineer.",
  "welcome_profession3_msg": "I am a manager.",
  "welcome_location_msg": "I live in Krakow",
  "welcome_btn_msg": "Contact Me",
  "career_title_desc": "Professional Work",
  "contact_title_desc": "Write to Me",
  "projects_title_desc": "My Projects",
  "free_time_title_desc": "Hobbies",
  "now": "now",
  "email_placeholder": "name@example.com",
  "name_placeholder": "Your name",
  "message_placeholder": "Type your message",
  "alt__my_photo": "My photo",
  "alt__gaming": "Gaming image - AI",
  "alt__sport": "Sport image - AI",
  "alt__horus": "Horus - Bengal Cat",
  "alt__dyi": "Balcony furniture",
  "alt__modelling": "F-14",
  "alt__oss": "Comarch OSS graphic",
  "alt__planner": "Room Plannera screen",
  "alt__plowhelper": "Device mounted in snowplow",
  "alt__todoapp": "Voice Todo app screen"
}