{
  "home": "Home",
  "career": "Career",
  "projects": "Projects",
  "free_time": "Free Time",
  "contact": "Contact",
  "copyrights": "Krzysztof Bartosik © 2023",
  "hello": "Hello!",
  "hello_msg": "My name is Krzysztof and I would like to introduce my personal website to You! I'm a web developer with over 10 years of commercial experience. This is a place where You can find out a few things about me, my career and some other things ;)",
  "developer": "Developer",
  "developer_desc": "Developer",
  "team_leader": "Team leader",
  "team_leader_desc": "Team leader",
  "director": "Web R&D Director",
  "director_desc": "Web R&D Director",
  "snow_plow_project_label": "snowPlowProjectLabel",
  "room_planner_project_label": "roomPlannerProjectLabel",
  "android_todo_project_label": "androidTodoProjectLabel",
  "comarch_oss_project_label": "comarch_oss_project_label",
  "comarch_oss_project_title": "Comarch OSS Console",
  "snow_plow_project_title": "Snow Plow Helper",
  "room_planner_project_title": "Room Planner",
  "android_todo_project_title":  "Voice Todo",
  "gaming_title": "Gaming",
  "gaming_desc": "Video games have been my passion since childhood. Some people outgrow it, but I guess I haven't. I'm not particularly picky; I enjoy every genre of games - action, FPSs, strategies, puzzles, but I think I'm most into all kinds of RPGs. If you want to play something, there's a good chance that will work out 😊 Below, I've included links to platforms. Feel free to contact me!",
  "sport_title": "Sports",
  "sport_desc": "I love sports! Watching, playing (if I have time), especially soccer. As a teenager, I played for a club in my hometown, but fate decided that I would continue my career in front of a computer rather than on the field. Besides soccer, which is definitely my number one, I'm eager to watch any kind of competition, especially if there are players with the white eagle on their chest. The only sport I don't quite understand is golf, although I would like to try playing it someday.",
  "horus_title": "Horus (Bengal cat)",
  "horus_desc": "Our cat - a rascal. Born in July 2022, full of energy and mischief. Horusio is a Bengal cat, and I'm including a link to Wikipedia below. He's everywhere, loves to interfere while mopping the floor. However, once he's done causing trouble, he's the most beloved and coolest cat in the world. He knows a few tricks, and he'll do anything for treats. Some say he's more like a dog, just looks a bit different.",
  "modelling_title": "Plastic Modelling",
  "modelling_desc": "At the beginning of 2023, I returned to this hobby from years ago. As a child, I used to assemble models, but it was only after rekindling this activity that I saw the incredible works of art that the best modelers can create. I still have a lot to learn from them, but I consider my first model, the F-14 Tomcat next to me, to have turned out not too bad. More projects are already on the horizon!",
  "dyi_title": "DYIs",
  "dyi_desc": "Power tools, the scent of sanded and drilled wood, that's the stuff! Every now and then, I find myself tinkering a bit. The engineer's sense certainly helps in the execution of various projects, as seen in the photo of the balcony crate-bed. I really enjoy building, whether it's from Lego blocks as a child, from React code as a programmer, or from wood or cardboard-gypsum when needed. The reward is always the same - the results of the work and the satisfaction that comes from creating something from scratch with your own hands.",
  "contact_info": "Have You found something interesting on my website? You wanna contact me? Feel free - use the conteact form below!",
  "email_label": "Your E-mail",
  "name_label": "Your Name",
  "message_label": "Message",
  "submit_btn_label": "Send",
  "message_sent": "Message has been sent!",
  "message_not_sent": "Oops, something went wrong",
  "contact_confirmation": "Thanks for sending me a message! I'm gonna answer as soon as possible!",
  "contact_error_msg": "Unfortunately message has not been sent. Try again later :(",
  "close": "Close",
  "welcome_hello_msg": "Welcome",
  "welcome_name_msg": "I'm Krzysztof Bartosik.",
  "welcome_profession1_msg": "I'm Web Developer.",
  "welcome_profession2_msg": "I'm an Engineer.",
  "welcome_profession3_msg": "I'm Manager.",
  "welcome_location_msg": "Based in Cracow, Poland",
  "welcome_btn_msg": "Contact me",
  "career_title_desc": "Professional Work",
  "contact_title_desc": "E-mail me",
  "projects_title_desc": "My projects",
  "free_time_title_desc": "Hobbies",
  "now": "now",
  "email_placeholder": "name@example.com",
  "name_placeholder": "Your name",
  "message_placeholder": "Type message"
}